/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   remove_diacritics.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ysabik <ysabik@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/03 07:10:04 by ysabik            #+#    #+#             */
/*   Updated: 2024/10/03 09:35:11 by ysabik           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_ls.h"

static const char	*g_table[100][50] = {
{"ae", "ä", "æ", "ǽ", NULL},
{"oe", "ö", "œ", NULL},
{"ue", "ü", NULL},
{"Ae", "Ä", NULL},
{"Ue", "Ü", NULL},
{"Oe", "Ö", NULL},
{"A", "À", "Á", "Â", "Ã", "Ä", "Å", "Ǻ", "Ā", "Ă", "Ą", "Ǎ", "Α", "Ά", "Ả",
	"Ạ", "Ầ", "Ẫ", "Ẩ", "Ậ", "Ằ", "Ắ", "Ẵ", "Ẳ", "Ặ", "А", NULL},
{"a", "à", "á", "â", "ã", "å", "ǻ", "ā", "ă", "ą", "ǎ", "ª", "α", "ά", "ả",
	"ạ", "ầ", "ấ", "ẫ", "ẩ", "ậ", "ằ", "ắ", "ẵ", "ẳ", "ặ", "а", NULL},
{"B", "Б", NULL},
{"b", "б", NULL},
{"C", "Ç", "Ć", "Ĉ", "Ċ", "Č", NULL},
{"c", "ç", "ć", "ĉ", "ċ", "č", NULL},
{"D", "Д", NULL},
{"d", "д", NULL},
{"Dj", "Ð", "Ď", "Đ", "Δ", NULL},
{"dj", "ð", "ď", "đ", "δ", NULL},
{"E", "È", "É", "Ê", "Ë", "Ē", "Ĕ", "Ė", "Ę", "Ě", "Ε", "Έ", "Ẽ", "Ẻ", "Ẹ",
	"Ề", "Ế", "Ễ", "Ể", "Ệ", "Е", "Э", NULL},
{"e", "è", "é", "ê", "ë", "ē", "ĕ", "ė", "ę", "ě", "έ", "ε", "ẽ", "ẻ", "ẹ",
	"ề", "ế", "ễ", "ể", "ệ", "е", "э", NULL},
{"F", "Ф", NULL},
{"f", "ф", NULL},
{"G", "Ĝ", "Ğ", "Ġ", "Ģ", "Γ", "Г", "Ґ", NULL},
{"g", "ĝ", "ğ", "ġ", "ģ", "γ", "г", "ґ", NULL},
{"H", "Ĥ", "Ħ", NULL},
{"h", "ĥ", "ħ", NULL},
{"I", "Ì", "Í", "Î", "Ï", "Ĩ", "Ī", "Ĭ", "Ǐ", "Į", "İ", "Η", "Ή", "Ί", "Ι",
	"Ϊ", "Ỉ", "Ị", "И", "Ы", NULL},
{"i", "ì", "í", "î", "ï", "ĩ", "ī", "ĭ", "ǐ", "į", "ı", "η", "ή", "ί", "ι",
	"ϊ", "ỉ", "ị", "и", "ы", "ї", NULL},
{"J", "Ĵ", NULL},
{"j", "ĵ", NULL},
{"K", "Ķ", "Κ", "К", NULL},
{"k", "ķ", "κ", "к", NULL},
{"L", "Ĺ", "Ļ", "Ľ", "Ŀ", "Ł", "Λ", "Л", NULL},
{"l", "ĺ", "ļ", "ľ", "ŀ", "ł", "λ", "л", NULL},
{"M", "М", NULL},
{"m", "м", NULL},
{"N", "Ñ", "Ń", "Ņ", "Ň", "Ν", "Н", NULL},
{"n", "ñ", "ń", "ņ", "ň", "ŉ", "ν", "н", NULL},
{"O", "Ò", "Ó", "Ô", "Õ", "Ō", "Ŏ", "Ǒ", "Ő", "Ơ", "Ø", "Ǿ", "Ο", "Ό", "Ω",
	"Ώ", "Ỏ", "Ọ", "Ồ", "Ố", "Ỗ", "Ổ", "Ộ", "Ờ", "Ớ", "Ỡ", "Ở", "Ợ", "О", NULL},
{"o", "ò", "ó", "ô", "õ", "ō", "ŏ", "ǒ", "ő", "ơ", "ø", "ǿ", "º", "ο", "ό", "ω",
	"ώ", "ỏ", "ọ", "ồ", "ố", "ỗ", "ổ", "ộ", "ờ", "ớ", "ỡ", "ở", "ợ", "о", NULL},
{"P", "П", NULL},
{"p", "п", NULL},
{"R", "Ŕ", "Ŗ", "Ř", "Ρ", "Р", NULL},
{"r", "ŕ", "ŗ", "ř", "ρ", "р", NULL},
{"S", "Ś", "Ŝ", "Ş", "Ș", "Š", "Σ", "С", NULL},
{"s", "ś", "ŝ", "ş", "ș", "š", "ſ", "σ", "ς", "с", NULL},
{"T", "Ț", "Ţ", "Ť", "Ŧ", "τ", "Т", NULL},
{"t", "ț", "ţ", "ť", "ŧ", "т", NULL},
{"U", "Ù", "Ú", "Û", "Ũ", "Ū", "Ŭ", "Ů", "Ű", "Ų", "Ư", "Ǔ", "Ǖ", "Ǘ", "Ǚ",
	"Ǜ", "Ũ", "Ủ", "Ụ", "Ừ", "Ứ", "Ữ", "Ử", "Ự", "У", NULL},
{"u", "ù", "ú", "û", "ũ", "ū", "ŭ", "ů", "ű", "ų", "ư", "ǔ", "ǖ", "ǘ", "ǚ",
	"ǜ", "υ", "ύ", "ϋ", "ủ", "ụ", "ừ", "ứ", "ữ", "ử", "ự", "у", NULL},
{"Y", "Ý", "Ÿ", "Ŷ", "Υ", "Ύ", "Ϋ", "Ỳ", "Ỹ", "Ỷ", "Ỵ", "Й", NULL},
{"y", "ý", "ÿ", "ŷ", "ỳ", "ỹ", "ỷ", "ỵ", "й", NULL},
{"V", "В", NULL},
{"v", "в", NULL},
{"W", "Ŵ", NULL},
{"w", "ŵ", NULL},
{"Z", "Ź", "Ż", "Ž", "Ζ", "З", NULL},
{"z", "ź", "ż", "ž", "ζ", "з", NULL},
{"AE", "Æ", "Ǽ", NULL},
{"ss", "ß", NULL},
{"IJ", "Ĳ", NULL},
{"ij", "ĳ", NULL},
{"OE", "Œ", NULL},
{"f", "ƒ", NULL},
{"ks", "ξ", NULL},
{"p", "π", NULL},
{"v", "β", NULL},
{"m", "μ", NULL},
{"ps", "ψ", NULL},
{"Yo", "Ё", NULL},
{"yo", "ё", NULL},
{"Ye", "Є", NULL},
{"ye", "є", NULL},
{"Yi", "Ї", NULL},
{"Zh", "Ж", NULL},
{"zh", "ж", NULL},
{"Kh", "Х", NULL},
{"kh", "х", NULL},
{"Ts", "Ц", NULL},
{"ts", "ц", NULL},
{"Ch", "Ч", NULL},
{"ch", "ч", NULL},
{"Sh", "Ш", NULL},
{"sh", "ш", NULL},
{"Shch", "Щ", NULL},
{"shch", "щ", NULL},
{"", "Ъ", "ъ", "Ь", "ь", NULL},
{"Yu", "Ю", NULL},
{"yu", "ю", NULL},
{"Ya", "Я", NULL},
{"ya", "я", NULL},
{NULL}
};

char	*_str(char c)
{
	return (ft_strdup((char [2]){c, 0}));
}

static int	_cmp(const char *s1, const char *s2)
{
	while (*s2)
	{
		if (*s1++ != *s2++)
			return (1);
	}
	return (0);
}

static char	*_next_char(char *str, size_t *i, t_bool alnum_only)
{
	size_t	j;
	size_t	k;

	j = 0;
	while (g_table[j][0])
	{
		k = 1;
		while (g_table[j][k])
		{
			if (!_cmp(str + *i, g_table[j][k]))
			{
				*i += ft_strlen(g_table[j][k]);
				return (ft_strdup(g_table[j][0]));
			}
			k++;
		}
		j++;
	}
	*i += 1;
	if (alnum_only)
		return (NULL);
	return (_str(str[*i - 1]));
}

static	char	*_strlst_join(t_strlst *lst)
{
	size_t		len;
	size_t		i;
	char		*str;
	t_strlst	*tmp;

	len = 0;
	tmp = lst;
	while (tmp)
	{
		len += ft_strlen(tmp->str);
		tmp = tmp->next;
	}
	str = (char *) ft_malloc(len + 1);
	i = 0;
	tmp = lst;
	while (str && tmp)
	{
		len = 0;
		while (tmp->str[len])
			str[i++] = tmp->str[len++];
		tmp = tmp->next;
	}
	if (str)
		str[i] = '\0';
	return (strlst_free(lst), str);
}

char	*remove_diacritics(char *str, t_bool alnum_only)
{
	size_t		i;
	t_strlst	*lst;

	i = 0;
	lst = NULL;
	while (str[i])
	{
		if ((str[i] >= '0' && str[i] <= '9') || (str[i] >= 'A' && str[i] <= 'Z')
			|| (str[i] >= 'a' && str[i] <= 'z'))
			strlst_add(&lst, strlst_new(_str(str[i++])));
		else
			strlst_add(&lst, strlst_new(_next_char(str, &i, alnum_only)));
	}
	return (_strlst_join(lst));
}
